Documents/ВрачебнаяКомиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВрачебнаяКомиссия</Name>
			<BasedOn>
				<xr:Item>Document.ЛистокНетрудоспособности</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьЦелиПроведенияВК</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистокНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотренныеВопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Диагнозы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диагноз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньОбоснованности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНозологическойЕдиницы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/КлассификацииДиагнозов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КлассификацииДиагнозов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
					<Comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окончательный</Name>
					<Comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РискЗаболевания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Острое</Name>
					<Comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХроническоеВпервыеВыявленное</Name>
					<Comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХроническоеРанееВыявленное</Name>
					<Comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбострениеХронического</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновноеЗаболевание</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсложнениеОсновногоЗаболевания</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующееЗаболевание</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Этапный</Name>
					<Comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебноМедицинский</Name>
					<Comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Патологоанатомический</Name>
					<Comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсложнениеСопутствующегоЗаболевания</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонкурирующееЗаболевание</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФоновоеЗаболевание</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяПричина</Name>
					<Comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВрачебнаяКомиссия/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		// Заполнение шапки
		Цель = Документы.ВрачебнаяКомиссия.ПолучитьЭлементЭкспертизаВременнойНетрудоспособоности();
		
		Клиент = ДанныеЗаполнения.Клиент;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения;
		МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;

		// Данные ЛН
		ДанныеЛН = Документы.ЛистокНетрудоспособности.ПолучитьПоследниееДанныеЛН(ДанныеЗаполнения);	
		СтрокаЛН = ДанныеЛН.НомерСтроки;
		ДатаНачалаНетрудоспособности = ДанныеЛН.ДатаНачала;
		ДатаОкончанияНетрудоспособности = ДанныеЛН.ДатаОкончания;
		ПредседательКомиссии = ДанныеЛН.ПредседательВК;
		Заключение = НСтр("ru='Продлить лист нетрудоспособности с '") 
					+ Формат(ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по "
					+ Формат(ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");
		
		// Состав комиссии
		ВрачЛН = ДанныеЛН.Врач;
		Если ЗначениеЗаполнено(ВрачЛН) И ПредседательКомиссии<>ВрачЛН Тогда
			СтрокаСотрудника = СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = ВрачЛН;	
		КонецЕсли; 			
		
		// Диагноз
		СтрокаДиагноза = Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = ДанныеЗаполнения.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Основание = ДанныеЗаполнения;
		МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;
		
		// Состав комиссии
		СтрокаСотрудника = СоставКомиссии.Добавить();
		СтрокаСотрудника.Сотрудник = ДанныеЗаполнения.Врач;
		
		// Диагнозы
		Для каждого СтрокаДиагноза Из ДанныеЗаполнения.Диагнозы Цикл
			НоваяСтрока = Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОтсортироватьДиагнозы();
	
	Если (Проведен И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения)
		Или РежимЗаписи = РежимЗаписиДокумента.Проведение
	Тогда
		СформироватьHTMLПредставление();
	Иначе
		HTMLПредставление = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтсортироватьДиагнозы()
	
	ТаблДиагнозы = Диагнозы.Выгрузить();
	ТаблДиагнозы.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаДиагнозы Из ТаблДиагнозы Цикл
		СтрокаДиагнозы.Приоритет = УстановитьПриоритетДиагноза(СтрокаДиагнозы.ВидНозологическойЕдиницы);	
	КонецЦикла; 
	ТаблДиагнозы.Сортировать("Приоритет, Диагноз");
	Диагнозы.Очистить();
	Для Каждого СтрокаДиагнозы Из ТаблДиагнозы Цикл
		НоваяСтрока = Диагнозы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДиагнозы);
	КонецЦикла; 
	
КонецПроцедуры

Функция УстановитьПриоритетДиагноза(ВидДиагноза)
	Если ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание Тогда
		Возврат 1;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсложнениеОсновногоЗаболевания Тогда 
		Возврат 2;	
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.СопутствующееЗаболевание Тогда 
		Возврат 3;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсложнениеСопутствующегоЗаболевания Тогда 
		Возврат 4;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.КонкурирующееЗаболевание Тогда 
		Возврат 5;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ФоновоеЗаболевание Тогда 
		Возврат 6;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ВнешняяПричина Тогда 
		Возврат 7;
	Иначе
		ВОзврат 8;
	КонецЕсли; 		
КонецФункции
 
#Область ШаблонHTML

Процедура СформироватьHTMLПредставление()
	
	СтруктураДокумента = ОбщегоНазначенияСервер.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураДокумента.Вставить("Диагнозы", Диагнозы.Выгрузить());
	СтруктураДокумента.Вставить("СоставКомиссии", СоставКомиссии.Выгрузить());
	
	ТабДок = Документы.ВрачебнаяКомиссия.Печать(СтруктураДокумента, "ПротоколВКК_ДляМедкарты");
	HTMLПредставление = ТабДок.Получитьтекст();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПодписанЭП = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектКопирования.Цель) 
		И ТипЗнч(ОбъектКопирования.Цель) = Тип("СправочникСсылка.удалитьЦелиПроведенияВК")
		И ЗначениеЗаполнено(ОбъектКопирования.Цель.УИДЕГИСЗ)
	Тогда
		Цель = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(ОбъектКопирования.Цель.УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ЦелиПроведенияВК)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
